In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
import math

In [7]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),index=pd.Index(['LA','SF'],name='City'),columns=pd.Index(['A','B','C','D'],name='letter'))

In [8]:
dframe1

letter  A  B  C  D
City
LA      0  1  2  3
SF      4  5  6  7

In [9]:
dframe_st = dframe1.stack()

In [11]:
dframe_st

City  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [13]:
dframe_st.unstack()

letter  A  B  C  D
City
LA      0  1  2  3
SF      4  5  6  7

In [14]:
dframe2 = DataFrame(np.arange(8).reshape(2,4),index=['LA','SF'],columns=['A','B','C','D'])

In [15]:
dframe2

    A  B  C  D
LA  0  1  2  3
SF  4  5  6  7

In [16]:
dframe_st.unstack('letter')

letter  A  B  C  D
City
LA      0  1  2  3
SF      4  5  6  7

In [18]:
t=dframe_st.unstack('City')

In [19]:
t.stack()

letter  City
A       LA      0
        SF      4
B       LA      1
        SF      5
C       LA      2
        SF      6
D       LA      3
        SF      7
dtype: int32

In [20]:
dframe_st.unstack('City')

City    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [21]:
ser1 = Series([0,1,2],index=['Q','X','Y'])
ser2 = Series([4,5,6],index=['X','Y','Z'])

In [32]:
dframe = pd.concat([ser1,ser2],keys=['Alpha','Beta'])

In [33]:
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [43]:
t=dframe.unstack()

In [44]:
t

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [45]:
l=t.stack()

In [41]:
l

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64